---
kind: property
id: P:Autodesk.Revit.DB.HermiteSpline.ControlPoints
source: html/15309d04-8e6c-df8e-5405-d2adcd7ff430.htm
---
# Autodesk.Revit.DB.HermiteSpline.ControlPoints Property

The control points of the Hermite spline.

## Syntax (C#)
```csharp
public IList<XYZ> ControlPoints { get; set; }
```